app/views/users/_unfollow.html.erb

SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = 1 AND ("relationships".follower_id = 2) LIMIT 1
---
<%= form_for current_user.relationships.find_by_followed_id(@user),
             :html => { :method => :delete },
             :remote => true do |f| %>