app/views/users/show.html.erb

SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)
---
	<strong>Cidade: </strong> <%= @user.cidade %><br />
      	<strong>Postagens: </strong> <%= @user.microposts.count %>