app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)
---
    <span class="microposts">
      <%= pluralize(current_user.microposts.count, "Postagens") %>