app/views/microposts/show.html.erb

<td>
    <% @users = User.find(comentario.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1