app/views/microposts/show.html.erb


<%= @microposts.comentarios.each do |comentario| %>
---
SELECT "comentarios".* FROM "comentarios" WHERE ("comentarios".micropost_id = 1) ORDER BY comentarios.created_at DESC