app/controllers/comentarios_controller.rb

  def create
    @comentario = Comentario.new(params[:comentario])

      if @comentario.save
---
INSERT INTO "comentarios" ("microposts_id", "created_at", "micropost_id", "user_id", "updated_at", "content", "users_id") VALUES (NULL, '2011-07-27 15:38:13.460845', NULL, 1, '2011-07-27 15:38:13.460845', 'dasfdsfafdsafdasdfdasfdsa', NULL)