app/controllers/comments_controller.rb

 	def create
	        @microposts = Micropost.find(params[:micropost_id])
		@comment = current_user.comments.create!(params[:comment])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = 'id' AND ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 1
INSERT INTO "comments" ("updated_at", "users_id", "content", "created_at", "microposts_id") VALUES ('2011-07-30 00:12:38.989924', NULL, 'dsadsadasdas', '2011-07-30 00:12:38.989924', NULL)

  	def show
    		#@comments = Comment.find(params[:id])
		@micropost = Micropost.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 LIMIT 1