app/controllers/helps_controller.rb

  def index
    @helps = Help.all
---
SELECT "helps".* FROM "helps" ORDER BY helps.created_at ASC

  def show
    @help = Help.find(params[:id])
---
SELECT "helps".* FROM "helps" WHERE "helps"."id" = 1 ORDER BY helps.created_at ASC LIMIT 1

  def edit
    @help = Help.find(params[:id])
---
SELECT "helps".* FROM "helps" WHERE "helps"."id" = 1 ORDER BY helps.created_at ASC LIMIT 1

  def create
    @help = Help.new(params[:help])

    respond_to do |format|
      if @help.save
---
INSERT INTO "helps" ("created_at", "descricao", "updated_at", "titulo") VALUES ('2011-07-26 05:08:36.822641', 'flash[:success] = "Postagem Criada!"flash[:success] = "Postagem Criada!"flash[:success] = "Postagem Criada!"flash[:success] = "Postagem Criada!"flash[:success] = "Postagem Criada!"flash[:success] = "Postagem Criada!"flash[:success] = "Postagem Criada!"', '2011-07-26 05:08:36.822641', 'Como se cadastrar ?')

  def update
    @help = Help.find(params[:id])

    respond_to do |format|
      if @help.update_attributes(params[:help])
---
SELECT "helps".* FROM "helps" WHERE "helps"."id" = 1 ORDER BY helps.created_at ASC LIMIT 1
UPDATE "helps" SET "titulo" = '1. O que é Espaço Cidadão ?', "updated_at" = '2011-07-27 17:30:44.205350' WHERE "helps"."id" = 1

  def destroy
    @help = Help.find(params[:id])
    @help.destroy
---
SELECT "helps".* FROM "helps" WHERE "helps"."id" = 2 ORDER BY helps.created_at ASC LIMIT 1
DELETE FROM "helps" WHERE "helps"."id" = 1