app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("tipo", "governante", "content", "titulo", "user_id", "updated_at", "created_at") VALUES ('Elogio', 'Agnelo Queiros', 'Obama faz novo apelo para fechar acordo da dívidaObama faz novo apelo para fechar acordo da dívidaObama faz novo apelo para fechar acordo da dívidaObama faz novo apelo para fechar acordo da dívidaObama faz novo apelo para fechar acordo da dívidaObama faz novo apelo para fechar acordo da dívidav', 'Obama faz novo apelo para fechar acordo da dívida', 1, '2011-07-29 23:01:25.365527', '2011-07-29 23:01:25.365527')

  def show
    @microposts = Micropost.find(params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = 19 ORDER BY microposts.created_at DESC LIMIT 1