app/controllers/users_controller.rb

  def index
    @title = "Todos os Usuários"
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("sexo", "estado", "email", "salt", "rg", "name", "cpf", "cidade", "telefone", "admin", "created_at", "encrypted_password", "updated_at", "data_nascimento", "logradouro", "tipo") VALUES ('Masculino', 'Distrito Federal', 'helderluciano18@hotmail.com', 'c9ea77be01a314b16d71462216927b55ad3f2bcecbcd601010dc017ecb517862', '2798967', 'Vandir Luciano', '03305855177', 'Ceilândia', '6139659367', 'f', '2011-07-29 23:58:46.696278', '1c4e31c6369460e350be2a86fa6d5150c79532c5136c751c0183fe5ab5a30558', '2011-07-29 23:58:46.696278', '1930-07-29', 'QNO 01 Conjunto B casa 14', 'Cidadão')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "cidade" = 'Ceilândia', "sexo" = 'Masculino', "updated_at" = '2011-07-26 02:50:52.054085', "rg" = '31321321', "telefone" = '6139659367', "logradouro" = 'QNO 01 Conjunto B casa 14', "cpf" = '38650681115', "estado" = 'Distrito Federal', "data_nascimento" = '1930-07-26' WHERE "users"."id" = 2

  def following
    @title = "Seguindo"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def followers
    @title = "Seguidores"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1